{
    "app": {
        "title": "Time series",
        "drawer_item": {
            "about": "About"
        }
    },
    "alert": {
        "select": "Select a year",
        "intro": "Click on \"Run GEE process\" to launch the process on your GEE account",
        "btn": "Run GEE process",
        "no_aoi": "The input are not correctly set up, please provide an asset in step 1",
        "no_year": "The input are not correctly set up, please provide a year for your alerts",
        "glad": "This data set, created by the [GLAD](https://glad.geog.umd.edu) (Global Land Analysis & Discovery) lab at the University of Maryland is the first Landsat-based alert system for tree cover loss. To retreive the alert you just need to select the date range you're interested in. \n  - dates need to be in the same year",
        "local": "The locally produced files need to be in the following format: \n  - the alert file : a **.TIF** file with value 1 if an alert exist 0 elsewhere. You can use other value to described other type of alerts (likely etc...). Contact the contributors via the issue panel if help is needed.\n  - The date file : a **.TIF** file with the julian date of the alerts (number of days since 01/01/0001), 0 elsewhere. it will be used by the driver to filter the useful alerts. If you don't have this file and you want to consider every alerts in your alert file. duplicate it and replace all the non zero by a know date (21/09/2020 = 737689).",
        "gee": "The alerts system coming from GEE need to be : \n  - the alerts : any gee **ImageCollection** with an alert band. 1 when there is an alert 0 elsewhere  \n  - the alert dates : any gee **ImageCollection** with an date band. the julian date of the alerts (number of days since 01/01/0001), 0 elsewhere. it will be used by the driver to filter the useful alerts. If you don't have this file and you want to consider every alerts in your alert file. duplicate it and replace all the non zero by a know date (21/09/2020 = 737689).", 
         "radd": "The RADD dataset (RAdar for Detecting Deforestation) developed by [Wageningen University](https://www.wur.nl/en/Research-Results/Chair-groups/Environmental-Sciences/Laboratory-of-Geo-information-Science-and-Remote-Sensing/Research/Sensing-measuring/RADD-Forest-Disturbance-Alert.htm) is a alert system based on sentinel-1 radar imagery. \n  - Covering Primary humid tropical forest over Africa and South-East Asia",
        "no_files": "The Downloading of your alerts on GEE has failed. Please see your GEE code editor for more information about the crash. It is usely because you are out of the geographic boundaries of your alert system."
    },
    "sepal": {
        "btn": "Run Sepal process",
        "no_process": "No process to display",
        "no_task": "The GEE process has not been completed, launch it or run a status check through step 2.",
        "already_done": "This computation has already been performed. You can find your results in the alert_result folder of your computer",
        "computation_completed": "Computation complete",
        "start_sepal": "The process has been launch on your SEPAL account",
        "csv_btn": "Download .csv distribution",
        "png_btn": "Download hist in .png",
        "tif_btn": "Download .tif alerts tile",
        "merge_tile": "Merge gee tiles",
        "identify_patch": "Identify all unique patch",
        "patch_size": "Compute patch size",
        "compress_file": "Compress file",
        "display_result": "Displaying the results",
        "no_display": "The computation is completed but the file is to big to be open on the fly. Please download the .tif file and open it on your local GIS.",
        "process_txt": "Alert analysis process steps are: \n\n  - Create patches of alerts as a raster (`.tif`) \n  - Compute the distribution of the alerts patches (`.csv`)",
        "no_alert": "the alert map is empty. There are no deforestation alerts on this area for the selected time period."
    },
    "driver": {
        "wrong_driver": "The selected alert type is not supported by this module",
        "select_alerts": "Select these alerts",
        "select_type": "Select the alert type",
        "select_date_file": "Select the date file",
        "select_alerts_file": "Select the alerts file",
        "select_date_asset": "Select date asset",
        "select_alerts_asset": "Select alerts asset",
        "wrong_year": "The GLAD alert dataset is build to work only on one single year. Please provide two dates in the same year instead of your first choice",
        "too_early": "The GLAD alert dataset has been released in 2017 no alerts are provided for previous years.",
        "radd_too_early": "The RADD alert dataset has been released in 2019 no alerts are provided for previous years.",
        "task_completed": "The task {0} launched on your GEE account is now completed",
        "already_completed": "The task {0} has already been completed on your GEE account",
        "task_running": "The task {} is runnning on your GEE account"
    }
}